BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
#include <Arduino.h>
//#include <string.h>
#include <time.h>

#include <ESP8266WiFi.h>
#include <ESP8266WiFiMulti.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>

#include <Hash.h>
//#include <ESPAsyncWebServer.h>
//#include <ESPAsyncTCP.h>
#include <WebServerFiles.cpp>

#include <FS.h>           //SPIFFS libraries.
#include <user_interface.h>   //Functions to handle RTC memory.
#include <rtc_memory.hpp>

#include <datalogger_config.h>  //Configuration parameters.

//----------------------------------------------------------------------------------------
DHT dht22_sensor_1(DHT_SENSOR_1_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_2(DHT_SENSOR_2_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_3(DHT_SENSOR_3_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object
DHT dht22_sensor_4(DHT_SENSOR_4_PIN, DHTTYPE);    //Creates DHT22 sensor "sensor" object

//---------------------------------------------------------------------------------------------------------------------
//Initialization functions.
void portInit(void);
uint8_t getBatteryLevel(void);           //Get battery level percentage (0 to 100%).
void setBatteryState(uint8 state=ON);     //Connects or disconnects battery.
void SetSensorPower(unsigned char state);
void wifiTurnOn(void);
void wifiTurnOff(void);
void goDeepSleep(uint64_t time);

void* stringToArray(std::string origin_string);
int32_t generateMeasurementValue(unsigned char type, float value);
String formatMeasurementValue(unsigned char type, float value);  //Converts measurements into valid format
void clearMeasurementsRAM(void);
unsigned char saveMeasurementsToRAM(void *data, unsigned short int bytes);
unsigned char saveDataRTC(int address, void *data, unsigned short int bytes); //Saves data to RTC memory.
void readDataRTC(int address, void *data, unsigned short int bytes);
void rtcMemoryInit(void);

//Functions to handle 
void handleHome(void);
void handleChangeNetworkConfig(void);
void handleChangeServerConfig(void);
unsigned char runWebServer(void);
unsigned char handleFormatRam(void);
unsigned char handleFormatFlash(void);
//---------------------------------------------------------------------------------------------------------------------

ESP8266WiFiMulti WiFiMulti;
ESP8266WebServer server(8080);


void setup() {
  portInit();
  wifiTurnOff();

  delay(200);
  if (digitalRead(14))    //
  {
    digitalWrite(15,HIGH);
    getBatteryLevel();
   
  }
  else
  {
    digitalWrite(15,LOW);
  }

  Serial.begin(115200);

  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  runWebServer();
  SPIFFS.begin();

//////////////////////////////////////////////////////////////

/* 
  SetSensorPower(ON);
  delay(1000);
  //GET MEASUREMENTS
  for (unsigned char i = 0; i<4 ; i++){
    Serial.printf("\nTemperature_%d: %f\n", i+1, temperature_float[i] );
    Serial.printf("Humidity_%d: %f\n", i+1,humidity_float[i] );
  } 
  SetSensorPower(OFF);
*/
  
  
  
}

void loop() {

  server.handleClient(); //Handling of incoming requests
  //Waits for WiFi connection
/*   if ((WiFiMulti.run() == WL_CONNECTED)) {
    Serial.printf("WiFi Connected!");
    
    WiFiClient client;
    HTTPClient http;
  
    Serial.print("[HTTP] begin...\n");
    if (http.begin(client, "http://192.168.0.172:8080/sendmeasurements")) {  // HTTP
      String request;

      
      //Send POST request
      Serial.print("[HTTP] POST...:\n");
      Serial.print(request);
      int httpCode = http.POST( request );
      //int httpCode = http.GET();

      // httpCode will be negative on error
      if (httpCode > 0) {
        // HTTP header has been send and Server response header has been handled
        Serial.printf("[HTTP] POST... code: %d\n", httpCode);
        
        // file found at server
        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
          String payload = http.getString();
          Serial.println(payload);
        }

        goDeepSleep(60e6);  //Deep sleep for low power consumption.

      } else {
        Serial.printf("[HTTP] GET failed, error: %s\n", http.errorToString(httpCode).c_str());
        goDeepSleep(60e6);
      }
      http.end();
    } 
    else {
      Serial.printf("[HTTP] Unable to connect\n");
      goDeepSleep(60e6);  //Deep sleep for low power consumption.
    }
  } 
*/

/* 
  measurement m;
  m.timestamp=1234567890; //Put current timestamp
  m.id_sensor[0]=1;   
  m.id_sensor[1]=2; 
  m.id_sensor[2]=3; 
  m.id_sensor[3]=4;
  m.temperature[0]=generateMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature()); 
  m.temperature[1]=generateMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
  m.temperature[2]=generateMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
  m.temperature[3]=generateMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
  m.humidity[0]=generateMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity()); 
  m.humidity[1]=generateMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity()); 
  m.humidity[2]=generateMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity()); 
  m.humidity[3]=generateMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity());  
  saveMeasurementsToRAM(&m, sizeof(m)); 
*/
  

 
  



  
}

void portInit(void){
  pinMode(PWR_SENSORS_PIN, OUTPUT);   //GPIO12 as output
  pinMode(14, INPUT);
  pinMode(15, OUTPUT);
  pinMode(13, OUTPUT);
  pinMode(12, OUTPUT);
  digitalWrite(15,LOW);
  digitalWrite(13,HIGH);
  digitalWrite(12,HIGH);
  SetSensorPower(OFF);          //Sensors start turned off.


}

uint8_t getBatteryLevel(void){
  uint16_t voltage = (uint16_t)((analogRead(BATTERY_SENSE_PIN))*(ADC_VOLTAGE_MV/1023));
  uint16_t real_voltage = (uint16_t)((float)(voltage*VBAT_VADC_RATIO));   //Actual voltage before divider.
  // Serial.printf("\nReal voltage = %dmV" ,real_voltage);
  uint8_t percentage = ( ((real_voltage - BATTERY_MIN_VOLTAGE)*100) / (BATTERY_MAX_VOLTAGE-BATTERY_MIN_VOLTAGE) );
  // Serial.printf("\nPercentage: %d" ,percentage);

  return percentage;  //Returns battery percentage.
}

