BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
void wifiTurnOn(void){
  WiFi.forceSleepWake();    //Turns on radio.
  delay(1);   //Necessary delay to settle.
  WiFi.mode(WIFI_STA);  // Bring up the WiFi connection.
  WiFi.persistent(false); //Wifi credentials loaded directly from flash (as specified below) and not overwritten to it.
  WiFiMulti.addAP("Fibertel WiFi866 2.4GHz", "01416592736");
}

unsigned char runWebServer(void){ 

  String ap_ssid="Datalogger";
  String ap_pssw="123456789!";
  
  //IPAddress local_IP(192,168,2,2);  //192.168.2.2
  //IPAddress gateway(192,168,2,1);   //192.168.2.1
  //IPAddress subnet(255,255,255,0);  //255.255.255.255
  //WiFi.softAPConfig(local_IP, gateway, subnet);
  
  WiFi.mode(WIFI_AP);
  while(!WiFi.softAP(ap_ssid, ap_pssw))
  {
    Serial.println(".");
    delay(100);
  }
  
  // Iniciar servidor
  server.begin();
  Serial.println("HTTP server started");

  Serial.println("");
  Serial.print("Initialized AP:\t");
  Serial.println(ap_ssid);
  Serial.print("IP address:\t");
  Serial.println(WiFi.softAPIP());
  Serial.print("MAC address:\t");
  Serial.println(WiFi.macAddress());
 
  
  server.on("/",handleHome);
  server.on("/change_network_config", handleChangeNetworkConfig);
  server.on("/change_server_config", handleChangeServerConfig);
  server.on("/format_ram",handleFormatRam);
  server.on("/format_flash",handleFormatFlash);

  return(1);
}

void handleHome(void){
  Serial.print("/");
  //Returns main page.
  server.send(200, "text/html", index_html);
}

void handleChangeNetworkConfig(void){
    Serial.print("/change_network_config");
    String new_ssid, new_password;
    
    if (server.hasArg("new_ssid") && server.hasArg("new_password"))
    {
        new_ssid = server.arg("new_ssid");
        new_password = server.arg("new_password");
        //Change parameters in Flash config file.

        server.send(200, "text/plain", "Network credentials modified correctly.");
        // Serial.printf("\nNetwork credentials modified:\nSSID:%s\nPass:%s",new_ssid,new_password);
    }
    else
    {
        server.send(200, "text/html", "ERROR: Wrong parameters.");
    }

    // DEBUG: Write arbitrary data to  RTC memory.
    //Get measurements...
  measurement m;    
  m.timestamp=millis(); //Put current timestamp
  m.id_sensor[0]=1;   
  m.id_sensor[1]=2; 
  m.id_sensor[2]=3; 
  m.id_sensor[3]=4;
  m.temperature[0]=190; 
  m.temperature[1]=195;
  m.temperature[2]=195;
  m.temperature[3]=192;
  m.humidity[0]=56; 
  m.humidity[1]=54; 
  m.humidity[2]=54; 
  m.humidity[3]=52;  
  //Save measurements into temporary memory.
  if ( ! saveMeasurementsToRAM(&m, sizeof(m))) //If data is not saved correctly in RAM...
  {
    Serial.printf("RTC memory full. Saving data to flash and clearing memory...");
    /* save to flash, clear RAM and then rewrite to it */
    
    //////////////////////////////////// Read data from RTC memory and stores in Flash ////////////////
        uint8 buf[288];   //Temporary buffer to read measurements
        for (uint8 i = RTC_MEMORY_MEASUREMENTS_START_BLOCK; 
            i <= RTC_MEMORY_MEASUREMENTS_END_BLOCK-RTC_MEMORY_MEASUREMENT_BLOCK_SIZE;
            i+= RTC_MEMORY_MEASUREMENT_BLOCK_SIZE){
              readDataRTC(i, &buf, RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*4);
            }
        writeDataToFlash(MEASUREMENTS_FILE_NAME, buf, sizeof(buf), 0);
      ///////////////////////////////////////////////////////////////////////////////////////////////////

    clearMeasurementsRAM();



  }

  readDataFromFlash(MEASUREMENTS_FILE_NAME, 0, 0, 0);
}

void handleChangeServerConfig(void){
  Serial.print("/change_server_config");
  String new_ip, new_port;
  
  //  uint8 buf[64];
  
  // for (uint8 i = RTC_MEMORY_MEASUREMENTS_START_BLOCK; 
  //     i <= RTC_MEMORY_MEASUREMENTS_END_BLOCK-RTC_MEMORY_MEASUREMENT_BLOCK_SIZE;
  //     i+= RTC_MEMORY_MEASUREMENT_BLOCK_SIZE){
  //       readDataRTC(i, &buf, RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*4);
  //     }

  if (server.hasArg("ip") && server.hasArg("port"))
  {
      new_ip = server.arg("new_ip");
      new_port = server.arg("new_port");
      /* Validate ip and port number */

      //Change parameters in Flash config file.
      server.send(200, "text/plain", "Server parameters modified correctly.");
      // Serial.printf("\nServer parameters modified:\nIP:%s\nPort:%s",new_ip,new_port);
  }
  else
  {
      server.send(200, "text/html", "ERROR: Wrong parameters.");
  } 
}

unsigned char handleFormatRam(void){
  if (server.hasArg("command"))
  {
    if(server.arg("command") == "format_confirm"){
      /*Call to format RAM*/
      clearMeasurementsRAM();
      Serial.printf("RAM Formatted.");
      server.send(200, "text/plain", "Server parameters modified correctly.");

      //////////////////////////////////// Read data from RTC memory and stores in Flash ////////////////
        uint8 buf[288];   //Temporary buffer to read measurements
        for (uint8 i = RTC_MEMORY_MEASUREMENTS_START_BLOCK; 
            i <= RTC_MEMORY_MEASUREMENTS_END_BLOCK-RTC_MEMORY_MEASUREMENT_BLOCK_SIZE;
            i+= RTC_MEMORY_MEASUREMENT_BLOCK_SIZE){
              readDataRTC(i, &buf, RTC_MEMORY_MEASUREMENT_BLOCK_SIZE*4);
            }
        writeDataToFlash(MEASUREMENTS_FILE_NAME, buf, sizeof(buf), 0);
      ///////////////////////////////////////////////////////////////////////////////////////////////////

      return(1);  //Returns 1 to inform that RAM has been erased correctly. This should drive to a reboot.
    }
  }
  server.send(200, "text/html", "ERROR: Wrong parameters.");
  return(0);  //Returns 1 to inform that RAM has NOT been erased correctly.
}

unsigned char handleFormatFlash(void){
  
  if(SPIFFS.remove(MEASUREMENTS_FILE_NAME)){    //Delete file.
    SPIFFS.format();
    Serial.printf("\nFLASH Formatted.\n");
    return(1);  //Returns 1 to inform that FLASH has been erased correctly. This should drive to a reboot.
  }
  else return 0;

}


